# -*- coding: utf-8 -*-


def menu(request):
    left_menu = {
        "menu": {
            (1, "#", "系统查询"):{
                (1, "#", "任务流程查询"):{},
                (2, "#", "流程修改"):{},
                (3, "#", "工作项查询"):{},
            },
            (2, "/", "任务管理"):{
                (1, "/workflow/create_task/", "流程创建"):{},
                (2, "/workflow/distribute_task/", "工作项分配"):{},
                (3, "#", "工作项受理"):{},
            }
            ,
            (3, "#", "系统维护"):{
                (1, "#", "人员维护"):{},
            },
            (4, "#", "人员管理"):{
                (1, "#", "工时"): {},
            },

        }
    }
    return left_menu
